tylertms/dspic33e-sim/tests/device/dspic33ep_mu/analog/adc_test.c
static void done_active_conversion_cases(TestState* state, Dspic33* cpu) {
    uint8_t module;
    for (module = 0u; module < DSPIC33_ADC_COUNT; module++) {
        dspic33_reset(cpu, 0u);
        set_input(cpu, 0u, 400u);
        configure_manual(cpu, module, 0u, 0u, 0u);
        start_manual(cpu, module);
        finish_conversion(cpu, module);
        expect(state, dspic33_read_word(cpu, buffers[module]) == 100u,
               "done active initial result");
        expect(state, (dspic33_read_word(cpu, controls[module]) & 0x0001u) != 0u,
               "done active initial completion");
        set_input(cpu, 0u, 800u);
        start_manual(cpu, module);
        expect(state, (dspic33_read_word(cpu, controls[module]) & 0x0001u) == 0u,
               "conversion start clears done");
        dspic33_write_word(cpu, controls[module],
                           (uint16_t)(dspic33_read_word(cpu, controls[module]) & ~0x0001u));
        expect(state, (dspic33_read_word(cpu, controls[module]) & 0x0001u) == 0u,
               "active conversion done clear");
        expect(state, dspic33_device_advance(cpu, 11u), "active conversion precompletion advance");
        expect(state, dspic33_read_word(cpu, buffers[module]) == 100u,
               "active conversion preserves prior result");
        expect(state, (dspic33_read_word(cpu, controls[module]) & 0x0001u) == 0u,
               "active conversion remains incomplete");
        expect(state, dspic33_device_advance(cpu, 1u), "active conversion completion advance");
        expect(state, dspic33_read_word(cpu, buffers[module]) == 200u,
               "active conversion completes after clear");
        expect(state, (dspic33_read_word(cpu, controls[module]) & 0x0001u) != 0u,
               "active conversion restores done");
    }
}

static void channel_cases(TestState* state, Dspic33* cpu) {
    uint8_t channel;
    for (channel = 0u; channel < 32u; channel++) {
        dspic33_reset(cpu, 0u);
        set_input(cpu, channel, (uint16_t)(0x40u + channel));
        configure_manual(cpu, 0u, 0x0400u, 0u, channel);
        start_manual(cpu, 0u);
        finish_conversion(cpu, 0u);
        expect(state, dspic33_read_word(cpu, 0x0300u) == (uint16_t)(0x40u + channel),
               "adc one channel selection");
    }
    for (channel = 0u; channel < 16u; channel++) {
        dspic33_reset(cpu, 0u);
        set_input(cpu, channel, (uint16_t)((channel + 1u) * 4u));
        configure_manual(cpu, 1u, 0u, 0u, channel);
        start_manual(cpu, 1u);
        finish_conversion(cpu, 1u);
        expect(state, dspic33_read_word(cpu, 0x0340u) == (uint16_t)(channel + 1u),
               "adc two channel selection");
    }

    dspic33_reset(cpu, 0u);
    set_input(cpu, 1u, 1000u);
    set_input(cpu, 2u, 3000u);
    configure_manual(cpu, 0u, 0x0400u, 0u, 0x0082u);
    start_manual(cpu, 0u);
    finish_conversion(cpu, 0u);
    expect(state, dspic33_read_word(cpu, 0x0300u) == 2000u, "differential channel subtraction");

    dspic33_reset(cpu, 0u);
    set_input(cpu, 0u, 400u);
    set_input(cpu, 1u, 800u);
    set_input(cpu, 2u, 1200u);
    set_input(cpu, 5u, 2000u);
    configure_manual(cpu, 0u, 0u, 0x020cu, 5u);
    start_manual(cpu, 0u);
    finish_conversion(cpu, 0u);
    expect(state, dspic33_read_word(cpu, 0x0300u) == 500u, "four channel lane zero");
    expect(state, dspic33_read_word(cpu, 0x0302u) == 100u, "four channel lane one");
    expect(state, dspic33_read_word(cpu, 0x0304u) == 200u, "four channel lane two");
    expect(state, dspic33_read_word(cpu, 0x0306u) == 300u, "four channel lane three");
}

static void sequence_cases(TestState* state, Dspic33* cpu) {
    dspic33_reset(cpu, 0u);
    set_input(cpu, 2u, 400u);
    set_input(cpu, 3u, 800u);
    configure_manual(cpu, 0u, 0u, 0x0005u, 0x0302u);
    start_manual(cpu, 0u);
    finish_conversion(cpu, 0u);
    start_manual(cpu, 0u);
    finish_conversion(cpu, 0u);
    expect(state, dspic33_read_word(cpu, 0x0300u) == 100u, "alternate sample a");
    expect(state, dspic33_read_word(cpu, 0x0302u) == 200u, "alternate sample b");

    dspic33_reset(cpu, 0u);
    set_input(cpu, 0u, 400u);
    set_input(cpu, 6u, 800u);
    set_input(cpu, 8u, 1200u);
    dspic33_write_word(cpu, 0x0330u, 0x0141u);
    configure_manual(cpu, 0u, 0u, 0x0408u, 0u);
    start_manual(cpu, 0u);
    finish_conversion(cpu, 0u);
    start_manual(cpu, 0u);
    finish_conversion(cpu, 0u);
    start_manual(cpu, 0u);
    finish_conversion(cpu, 0u);
    expect(state, dspic33_read_word(cpu, 0x0300u) == 100u, "scan first channel");
    expect(state, dspic33_read_word(cpu, 0x0302u) == 200u, "scan second channel");
    expect(state, dspic33_read_word(cpu, 0x0304u) == 300u, "scan third channel");
    expect(state, interrupt_flag(cpu, 13u), "scan boundary interrupt");
    clear_interrupt(cpu, 13u);
    start_manual(cpu, 0u);
    finish_conversion(cpu, 0u);
    expect(state, dspic33_read_word(cpu, 0x0300u) == 100u, "scan boundary restart");

    dspic33_reset(cpu, 0u);
    set_input(cpu, 0u, 400u);
    configure_manual(cpu, 0u, 0u, 0x0006u, 0u);
    start_manual(cpu, 0u);
    finish_conversion(cpu, 0u);
    expect(state, !interrupt_flag(cpu, 13u), "split buffer no early interrupt");
    start_manual(cpu, 0u);
    finish_conversion(cpu, 0u);
    expect(state, interrupt_flag(cpu, 13u), "split buffer interrupt");
    expect(state, (dspic33_read_word(cpu, 0x0322u) & 0x0080u) != 0u,
           "split buffer second half status");
    clear_interrupt(cpu, 13u);
    start_manual(cpu, 0u);
    finish_conversion(cpu, 0u);
    expect(state, dspic33_read_word(cpu, 0x0310u) == 100u, "split buffer second half result");
}

static void conversion_pipeline_cases(TestState* state, Dspic33* cpu) {
    static const uint8_t channels[4] = {5u, 0u, 1u, 2u};
    static const uint16_t initial[4] = {2000u, 400u, 800u, 1200u};
    static const uint16_t sequential[4] = {500u, 200u, 400u, 600u};
    static const uint16_t simultaneous[4] = {500u, 100u, 200u, 300u};
    uint8_t lane;
    dspic33_reset(cpu, 0u);
    for (lane = 0u; lane < 4u; lane++) {
        set_input(cpu, channels[lane], initial[lane]);
    }
    dspic33_write_word(cpu, 0x0326u, 0x020cu);
    configure_manual(cpu, 0u, 0u, 0x020cu, 5u);
    start_manual(cpu, 0u);
    for (lane = 0u; lane < 4u; lane++) {
        expect(state, dspic33_device_advance(cpu, 11u),
               "advance sequential adc before lane completion");
        if (lane + 1u < 4u) {
            set_input(cpu, channels[lane + 1u], (uint16_t)(initial[lane + 1u] * 2u));
        }
        expect(state,
               dspic33_read_word(cpu, (uint16_t)(0x0300u + lane * 2u)) == 0u &&
                   (dspic33_read_word(cpu, 0x0320u) & 1u) == 0u,
               "sequential adc lane remains pending");
        expect(state, dspic33_device_advance(cpu, 1u), "advance sequential adc lane completion");
        expect(state, dspic33_read_word(cpu, (uint16_t)(0x0300u + lane * 2u)) == sequential[lane],
               "sequential adc captures at each conversion boundary");
    }
    expect(state, (dspic33_read_word(cpu, 0x0320u) & 1u) != 0u,
           "sequential adc completes after every lane");

    dspic33_reset(cpu, 0u);
    for (lane = 0u; lane < 4u; lane++) {
        set_input(cpu, channels[lane], initial[lane]);
    }
    dspic33_write_word(cpu, 0x0326u, 0x020cu);
    configure_manual(cpu, 0u, 0x0008u, 0x020cu, 5u);
    start_manual(cpu, 0u);
    for (lane = 0u; lane < 4u; lane++) {
        set_input(cpu, channels[lane], 4000u);
    }
    expect(state, dspic33_device_advance(cpu, 47u),
           "advance simultaneous adc before final completion");
    expect(state,
           dspic33_read_word(cpu, 0x0300u) == simultaneous[0] &&
               dspic33_read_word(cpu, 0x0302u) == simultaneous[1] &&
               dspic33_read_word(cpu, 0x0304u) == simultaneous[2] &&
               dspic33_read_word(cpu, 0x0306u) == 0u &&
               (dspic33_read_word(cpu, 0x0320u) & 1u) == 0u,
           "simultaneous adc holds trigger-time samples through pipeline");
    expect(state, dspic33_device_advance(cpu, 1u), "advance simultaneous adc final lane");
    expect(state,
           dspic33_read_word(cpu, 0x0306u) == simultaneous[3] &&
               (dspic33_read_word(cpu, 0x0320u) & 1u) != 0u,
           "simultaneous adc completes after all conversion periods");
}

static void pmd_cases(TestState* state, Dspic33* cpu) {
    static const uint16_t pmd_addresses[DSPIC33_ADC_COUNT] = {0x0760u, 0x0764u};
    uint8_t module;
    for (module = 0u; module < DSPIC33_ADC_COUNT; module++) {
        dspic33_reset(cpu, 0u);
        set_input(cpu, 0u, 400u);
        configure_manual(cpu, module, 0u, 0u, 0u);
        start_manual(cpu, module);
        dspic33_gpio_input(cpu, 1u, 1u);
        expect(state, (dspic33_read_word(cpu, 0x0e12u) & 1u) == 0u,
               "analog shared pin suppresses digital input before PMD");
        dspic33_write_word(cpu, pmd_addresses[module], 1u);
        expect(state, cpu->io.adc_pmd_disabled == 0u, "adc PMD waits one instruction cycle");
        expect(state, dspic33_device_advance(cpu, 1u), "advance adc PMD disable boundary");
        expect(state,
               cpu->io.adc_pmd_disabled == (uint8_t)(1u << module) &&
                   dspic33_read_word(cpu, controls[module]) == 0u &&
                   cpu->io.adc_latched_count[module] == 0u,
               "adc PMD disables access and aborts conversion");
        expect(state, (dspic33_read_word(cpu, 0x0e12u) & 1u) != 0u,
               "adc PMD changes shared analog pin to digital function");
        dspic33_write_word(cpu, controls[module], 0xffffu);
        dspic33_write_word(cpu, buffers[module], 0xffffu);
        expect(state,
               stored_word(cpu, controls[module]) == 0u &&
                   dspic33_read_word(cpu, controls[module]) == 0u &&
                   dspic33_read_word(cpu, buffers[module]) == 0u,
               "adc PMD blocks register access");
        dspic33_write_word(cpu, pmd_addresses[module], 0u);
        expect(state, dspic33_device_advance(cpu, 1u), "advance adc PMD enable boundary");
        expect(state,
               cpu->io.adc_pmd_disabled == 0u && dspic33_read_word(cpu, controls[module]) == 0u &&
                   (dspic33_read_word(cpu, 0x0e12u) & 1u) == 0u,
               "adc PMD enable leaves module reset");
    }

    dspic33_reset(cpu, 0u);
    dspic33_write_word(cpu, 0x0744u, 0x3800u);
    dspic33_write_word(cpu, 0x0760u, 1u);
    expect(state, dspic33_device_advance(cpu, 7u) && cpu->io.adc_pmd_disabled == 0u,
           "DOZE scales adc PMD instruction boundary");
    expect(state, dspic33_device_advance(cpu, 1u) && cpu->io.adc_pmd_disabled == 1u,
           "adc PMD completes at divided instruction boundary");

    dspic33_reset(cpu, 0u);
    dspic33_write_word(cpu, 0x0760u, 1u);
    dspic33_write_word(cpu, 0x0760u, 0u);
    expect(state,
           dspic33_device_advance(cpu, 1u) && cpu->io.adc_pmd_disabled == 0u &&
               cpu->events.count == 0u,
           "new adc PMD request invalidates stale transition");

    dspic33_reset(cpu, 0u);
    cpu->io.adc_pmd_generation[0] = 0x7fffu;
    dspic33_write_word(cpu, 0x0760u, 1u);
    expect(state,
           dspic33_device_advance(cpu, 1u) && cpu->io.adc_pmd_generation[0] == 0x8000u &&
               cpu->io.adc_pmd_disabled == 1u && cpu->events.count == 0u,
           "adc PMD transition crosses high generation bit");

    dspic33_reset(cpu, 0u);
    cpu->device_cycles = UINT64_MAX;
    dspic33_write_word(cpu, 0x0760u, 1u);
    expect(state,
           cpu->stop_reason == DSPIC33_EVENT_QUEUE_ERROR && dspic33_read_word(cpu, 0x0760u) == 0u &&
               cpu->io.adc_pmd_disabled == 0u && cpu->events.count == 0u,
           "adc PMD scheduling failure rolls back request");

    dspic33_reset(cpu, 0u);
    dspic33_write_word(cpu, 0x0760u, 1u);
    dspic33_write_word(cpu, 0x0764u, 1u);
    expect(state,
           dspic33_device_advance(cpu, 1u) && cpu->io.adc_pmd_disabled == 3u &&
               cpu->events.count == 0u,
           "adc PMD modules transition independently");
}

static void threshold_cases(TestState* state, Dspic33* cpu) {
    uint8_t module;
    uint8_t threshold;
    uint8_t sample;
    for (module = 0u; module < DSPIC33_ADC_COUNT; module++) {
        for (threshold = 1u; threshold <= 16u; threshold++) {
            dspic33_reset(cpu, 0u);
            set_input(cpu, 0u, 400u);
            configure_manual(cpu, module, 0u, (uint16_t)((threshold - 1u) << 2u), 0u);
            for (sample = 1u; sample <= threshold; sample++) {
                start_manual(cpu, module);
                finish_conversion(cpu, module);
                expect(state, interrupt_flag(cpu, irqs[module]) == (sample == threshold),
                       "sample increment threshold");
            }
        }
    }
}

