tylertms/dspic33e-sim/tests/device/dspic33ep_mu/analog/adc_test.c
static void dma_interrupt_rate_cases(TestState* state, Dspic33* cpu) {
    uint8_t module;
    uint8_t sample;
    for (module = 0u; module < DSPIC33_ADC_COUNT; module++) {
        dspic33_reset(cpu, 0u);
        set_input(cpu, 0u, 400u);
        configure_manual(cpu, module, 0u, 0x000cu, 0u);
        for (sample = 1u; sample <= 4u; sample++) {
            start_manual(cpu, module);
            expect(state, (dspic33_read_word(cpu, controls[module]) & 0x0001u) == 0u,
                   "non-dma conversion start clears done");
            finish_conversion(cpu, module);
            expect(state, (dspic33_read_word(cpu, controls[module]) & 0x0001u) != 0u,
                   "non-dma conversion sets done");
            expect(state, interrupt_flag(cpu, irqs[module]) == (sample == 4u),
                   "non-dma sample interrupt rate");
        }

        dspic33_reset(cpu, 0u);
        set_input(cpu, 0u, 400u);
        dspic33_write_word(cpu, dma_controls[module], 0x0100u);
        configure_manual(cpu, module, 0u, 0x000cu, 0u);
        for (sample = 1u; sample <= 4u; sample++) {
            start_manual(cpu, module);
            expect(state, (dspic33_read_word(cpu, controls[module]) & 0x0001u) == 0u,
                   "dma conversion start clears done");
            finish_conversion(cpu, module);
            expect(state, (dspic33_read_word(cpu, controls[module]) & 0x0001u) != 0u,
                   "dma conversion sets done");
            expect(state, interrupt_flag(cpu, irqs[module]), "dma conversion interrupt rate");
            clear_interrupt(cpu, irqs[module]);
            expect(state, !interrupt_flag(cpu, irqs[module]), "dma conversion interrupt clear");
        }
    }
}

static void trigger_cases(TestState* state, Dspic33* cpu) {
    static const uint8_t sources[] = {1u, 2u, 3u, 4u, 5u, 8u, 9u, 10u, 11u, 12u, 13u, 14u};
    uint8_t module;
    uint8_t index;
    for (module = 0u; module < DSPIC33_ADC_COUNT; module++) {
        for (index = 0u; index < sizeof(sources) / sizeof(sources[0]); index++) {
            uint8_t source = sources[index];
            dspic33_reset(cpu, 0u);
            set_input(cpu, 0u, 400u);
            configure_manual(cpu, module, (uint16_t)(source << 4u), 0u, 0u);
            dspic33_write_word(cpu, controls[module],
                               (uint16_t)(dspic33_read_word(cpu, controls[module]) | 0x0002u));
            expect(state, dspic33_adc_trigger(cpu, module, source == 1u ? 2u : 1u, 0u),
                   "schedule wrong adc trigger");
            dspic33_device_advance(cpu, 0u);
            finish_conversion(cpu, module);
            expect(state, (dspic33_read_word(cpu, controls[module]) & 1u) == 0u,
                   "wrong adc trigger ignored");
            expect(state, dspic33_adc_trigger(cpu, module, source, 0u), "schedule adc trigger");
            dspic33_device_advance(cpu, 0u);
            finish_conversion(cpu, module);
            expect(state, dspic33_read_word(cpu, buffers[module]) == 100u,
                   "external adc trigger result");
            expect(state, ((dspic33_read_word(cpu, controls[module]) & 1u) != 0u) == (source != 1u),
                   "B1 external interrupt trigger leaves adc done clear");
        }
    }
    expect(state, !dspic33_adc_trigger(cpu, 2u, 1u, 0u), "reject adc module");
    expect(state, !dspic33_adc_trigger(cpu, 0u, 0u, 0u), "reject manual trigger");
    expect(state, !dspic33_adc_trigger(cpu, 0u, 6u, 0u), "reject reserved trigger");
    expect(state, !dspic33_adc_trigger(cpu, 0u, 7u, 0u), "reject auto trigger");
    expect(state, !dspic33_adc_trigger(cpu, 0u, 15u, 0u), "reject trigger group");

    dspic33_reset(cpu, 0u);
    set_input(cpu, 0u, 400u);
    dspic33_write_word(cpu, 0x0324u, 0x0100u);
    dspic33_write_word(cpu, 0x0320u, 0x8074u);
    expect(state, dspic33_device_advance(cpu, 1u), "auto sample advance");
    expect(state, (dspic33_read_word(cpu, 0x0320u) & 0x0002u) == 0u,
           "auto sample starts conversion");
    expect(state, dspic33_device_advance(cpu, 12u), "auto conversion advance");
    expect(state, dspic33_read_word(cpu, 0x0300u) == 100u, "auto conversion result");
    expect(state, (dspic33_read_word(cpu, 0x0320u) & 0x0003u) == 0x0003u,
           "auto conversion restarts sampling");
    expect(state, dspic33_device_advance(cpu, 1u), "next auto sample advance");
    expect(state, (dspic33_read_word(cpu, 0x0320u) & 0x0003u) == 0u,
           "next auto conversion clears state");

    dspic33_reset(cpu, 0u);
    set_input(cpu, 0u, 400u);
    dspic33_write_word(cpu, 0x0324u, 0u);
    dspic33_write_word(cpu, 0x0320u, 0x8074u);
    expect(state, dspic33_device_advance(cpu, 0u), "zero SAMC automatic sample boundary");
    expect(state, (dspic33_read_word(cpu, 0x0320u) & 0x0002u) == 0u && cpu->events.count == 1u,
           "zero SAMC begins conversion without an extra clock");
}

static void timer_trigger_cases(TestState* state, Dspic33* cpu) {
    static const uint8_t modules[] = {0u, 1u};
    static const uint16_t counters[] = {0x010au, 0x0118u};
    static const uint16_t periods[] = {0x010eu, 0x011cu};
    static const uint16_t controls_16[] = {0x0112u, 0x0120u};
    static const uint16_t low_counters[] = {0x0106u, 0x0114u};
    static const uint16_t low_periods[] = {0x010cu, 0x011au};
    static const uint16_t low_controls[] = {0x0110u, 0x011eu};
    static const uint8_t sources[] = {2u, 4u};
    uint8_t index;
    for (index = 0u; index < 2u; index++) {
        uint8_t module = modules[index];
        dspic33_reset(cpu, 0u);
        set_input(cpu, 0u, 400u);
        configure_manual(cpu, module, (uint16_t)(sources[index] << 4u), 0u, 0u);
        dspic33_write_word(cpu, controls[module],
                           (uint16_t)(dspic33_read_word(cpu, controls[module]) | 0x0002u));
        dspic33_write_word(cpu, counters[index], 0u);
        dspic33_write_word(cpu, periods[index], 1u);
        dspic33_write_word(cpu, controls_16[index], 0x8000u);
        expect(state, dspic33_device_advance(cpu, 1u), "Type C timer period triggers matching ADC");
        expect(state, (dspic33_read_word(cpu, controls[module]) & 0x0002u) == 0u,
               "Type C timer trigger ends ADC sampling");
        finish_conversion(cpu, module);
        expect(state, dspic33_read_word(cpu, buffers[module]) == 100u,
               "Type C timer trigger completes ADC conversion");

        dspic33_reset(cpu, 0u);
        set_input(cpu, 0u, 400u);
        configure_manual(cpu, module, (uint16_t)(sources[index] << 4u), 0u, 0u);
        dspic33_write_word(cpu, controls[module],
                           (uint16_t)(dspic33_read_word(cpu, controls[module]) | 0x0002u));
        dspic33_write_word(cpu, low_counters[index], 0u);
        dspic33_write_word(cpu, counters[index], 0u);
        dspic33_write_word(cpu, low_periods[index], 1u);
        dspic33_write_word(cpu, periods[index], 0u);
        dspic33_write_word(cpu, low_controls[index], 0x8008u);
        expect(state, dspic33_device_advance(cpu, 1u),
               "paired Type C timer period triggers matching ADC");
        expect(state, (dspic33_read_word(cpu, controls[module]) & 0x0002u) == 0u,
               "paired timer trigger ends ADC sampling");
    }
}

static void dma_cases(TestState* state, Dspic33* cpu) {
    static const uint8_t scan_channels[] = {0u, 6u, 8u, 9u, 10u, 11u, 12u, 13u, 14u, 15u};
    uint8_t index;
    dspic33_reset(cpu, 0u);
    for (index = 0u; index < sizeof(scan_channels); index++) {
        set_input(cpu, scan_channels[index], (uint16_t)((index + 1u) * 16u));
    }
    dspic33_write_word(cpu, 0x0b00u, 0u);
    dspic33_write_word(cpu, 0x0b02u, 13u);
    dspic33_write_word(cpu, 0x0b04u, 0x2000u);
    dspic33_write_word(cpu, 0x0b06u, 0u);
    dspic33_write_word(cpu, 0x0b0cu, 0x0300u);
    dspic33_write_word(cpu, 0x0b0eu, 9u);
    dspic33_write_word(cpu, 0x0b00u, 0x8002u);
    dspic33_write_word(cpu, 0x0330u, 0xff41u);
    dspic33_write_word(cpu, 0x0332u, 0x0101u);
    configure_manual(cpu, 0u, 0x1400u, 0x0424u, 0u);
    for (index = 0u; index < sizeof(scan_channels); index++) {
        start_manual(cpu, 0u);
        finish_conversion(cpu, 0u);
    }
    for (index = 0u; index < sizeof(scan_channels); index++) {
        expect(state,
               dspic33_read_word(cpu, (uint16_t)(0x2000u + index * 2u)) ==
                   (uint16_t)((index + 1u) * 16u),
               "ordered adc dma result");
    }
    expect(state, !interrupt_flag(cpu, 4u) && cpu->io.dma_index[0] == 9u,
           "ordered adc dma remains active before completion");
    expect(state, dspic33_device_advance(cpu, 1u), "ordered adc dma completion advance");
    expect(state, interrupt_flag(cpu, 4u), "ordered adc dma block interrupt");
    expect(state, interrupt_flag(cpu, 13u), "ordered adc increment interrupt");

    dspic33_reset(cpu, 0u);
    set_input(cpu, 1u, 400u);
    set_input(cpu, 3u, 800u);
    dspic33_write_word(cpu, 0x0b00u, 0u);
    dspic33_write_word(cpu, 0x0b02u, 13u);
    dspic33_write_word(cpu, 0x0b04u, 0x3000u);
    dspic33_write_word(cpu, 0x0b06u, 0u);
    dspic33_write_word(cpu, 0x0b0cu, 0x0300u);
    dspic33_write_word(cpu, 0x0b0eu, 3u);
    dspic33_write_word(cpu, 0x0b00u, 0x8020u);
    dspic33_write_word(cpu, 0x0330u, 0x000au);
    dspic33_write_word(cpu, 0x0332u, 0x0101u);
    configure_manual(cpu, 0u, 0u, 0x040cu, 0u);
    for (index = 0u; index < 4u; index++) {
        start_manual(cpu, 0u);
        finish_conversion(cpu, 0u);
    }
    expect(state, dspic33_read_word(cpu, 0x3004u) == 100u,
           "scatter adc first channel first sample");
    expect(state, dspic33_read_word(cpu, 0x3006u) == 100u,
           "scatter adc first channel second sample");
    expect(state, dspic33_read_word(cpu, 0x300cu) == 200u,
           "scatter adc second channel first sample");
    expect(state, dspic33_read_word(cpu, 0x300eu) == 200u,
           "scatter adc second channel second sample");
}

static void power_cases(TestState* state, Dspic33* cpu) {
    dspic33_reset(cpu, 0u);
    set_input(cpu, 0u, 400u);
    configure_manual(cpu, 0u, 0x2000u, 0u, 0u);
    start_manual(cpu, 0u);
    cpu->power_state = DSPIC33_POWER_IDLE;
    dspic33_device_power_state_changed(cpu);
    finish_conversion(cpu, 0u);
    expect(state,
           (dspic33_read_word(cpu, 0x0320u) & 3u) == 0u && cpu->io.adc_latched_count[0] == 0u &&
               cpu->events.count == 0u,
           "adc stops and aborts in idle");

    dspic33_reset(cpu, 0u);
    set_input(cpu, 0u, 400u);
    configure_manual(cpu, 0u, 0u, 0u, 0u);
    start_manual(cpu, 0u);
    cpu->power_state = DSPIC33_POWER_IDLE;
    dspic33_device_power_state_changed(cpu);
    finish_conversion(cpu, 0u);
    expect(state, dspic33_read_word(cpu, 0x0300u) == 100u, "adc continues in idle");

    dspic33_reset(cpu, 0u);
    set_input(cpu, 0u, 400u);
    dspic33_write_word(cpu, 0x0324u, 0x8000u);
    configure_manual(cpu, 0u, 0u, 0u, 0u);
    start_manual(cpu, 0u);
    cpu->power_state = DSPIC33_POWER_SLEEP;
    dspic33_device_power_state_changed(cpu);
    finish_conversion(cpu, 0u);
    expect(state, dspic33_read_word(cpu, 0x0300u) == 100u && cpu->io.adc_sleep_disabled == 1u,
           "internal adc clock completes then stops in sleep without interrupt");
    cpu->power_state = DSPIC33_POWER_ACTIVE;
    dspic33_device_power_state_changed(cpu);
    expect(state, cpu->io.adc_sleep_disabled == 0u, "adc sleep-only stop clears after wake");

    dspic33_reset(cpu, 0u);
    set_input(cpu, 0u, 400u);
    dspic33_write_word(cpu, 0x0820u, 0x2000u);
    dspic33_write_word(cpu, 0x0324u, 0x8000u);
    configure_manual(cpu, 0u, 0u, 0u, 0u);
    start_manual(cpu, 0u);
    cpu->power_state = DSPIC33_POWER_SLEEP;
    dspic33_device_power_state_changed(cpu);
    finish_conversion(cpu, 0u);
    expect(state,
           dspic33_read_word(cpu, 0x0300u) == 100u && cpu->io.adc_sleep_disabled == 0u &&
               interrupt_flag(cpu, 13u),
           "enabled adc interrupt keeps RC converter active in sleep");

    dspic33_reset(cpu, 0u);
    set_input(cpu, 0u, 400u);
    configure_manual(cpu, 0u, 0u, 0u, 0u);
    start_manual(cpu, 0u);
    cpu->power_state = DSPIC33_POWER_SLEEP;
    dspic33_device_power_state_changed(cpu);
    finish_conversion(cpu, 0u);
    expect(state,
           dspic33_read_word(cpu, 0x0300u) == 0u && (dspic33_read_word(cpu, 0x0320u) & 3u) == 0u &&
               cpu->events.count == 0u,
           "system-clock adc aborts in sleep");
}

