tylertms/dspic33e-sim/tests/device/dspic33ep_mu/analog/adc_test.c
static void boundary_cases(TestState* state, Dspic33* cpu) {
    uint8_t sample;

    dspic33_reset(cpu, 0u);
    dspic33_device_internal_adc_begin_sampling(cpu, 0u);
    dspic33_device_internal_run_adc(cpu, DSPIC33_ADC_COUNT, 0u);
    expect(state, cpu->stop_reason == DSPIC33_RUNNING,
           "disabled and invalid ADC operations are ignored");

    dspic33_reset(cpu, 0u);
    cpu->io.adc_pmd_disabled = 1u;
    dspic33_write_word(cpu, 0x0320u, 0x8000u);
    dspic33_device_internal_adc_begin_sampling(cpu, 0u);
    dspic33_device_internal_run_adc(cpu, 0u, 0x0100u);
    expect(state, cpu->io.adc_latched_count[0] == 0u, "ADC PMD blocks sampling and completion");

    dspic33_reset(cpu, 0u);
    dspic33_device_internal_run_adc(cpu, 0u, 0x0100u);
    dspic33_write_word(cpu, 0x0320u, 0x8000u);
    dspic33_device_internal_run_adc(cpu, 0u, 0x0100u);
    expect(state, dspic33_read_word(cpu, 0x0300u) == 0u,
           "ADC ignores completion without a latched conversion");

    dspic33_reset(cpu, 0u);
    dspic33_device_internal_raw_write_word(cpu, 0x0320u, 0x8004u);
    dspic33_device_internal_adc_update_power_state(cpu);
    expect(state, (dspic33_read_word(cpu, 0x0320u) & 2u) != 0u,
           "active ADC power starts automatic sampling");

    dspic33_reset(cpu, 0u);
    dspic33_device_internal_raw_write_word(cpu, 0x0320u, 0x8002u);
    dspic33_device_internal_raw_write_word(cpu, 0x0322u, 0x0400u);
    dspic33_device_internal_run_adc(cpu, 0u, 0u);
    expect(state, cpu->io.adc_latched_channel[0][0] == 0u,
           "ADC scan with no selections uses the configured channel");

    dspic33_reset(cpu, 0u);
    set_input(cpu, 0u, 0xffffu);
    configure_manual(cpu, 0u, 0x0400u, 0u, 0u);
    start_manual(cpu, 0u);
    finish_conversion(cpu, 0u);
    expect(state, dspic33_read_word(cpu, 0x0300u) == 0x0fffu, "adc input range mask");

    dspic33_reset(cpu, 0u);
    set_input(cpu, 0u, 400u);
    configure_manual(cpu, 0u, 0x0010u, 0u, 0u);
    dspic33_write_word(cpu, 0x0320u, 0x8012u);
    expect(state, dspic33_adc_trigger(cpu, 0u, 1u, 5u), "delayed adc trigger");
    expect(state, dspic33_device_advance(cpu, 4u), "advance before adc trigger");
    expect(state, (dspic33_read_word(cpu, 0x0320u) & 0x0002u) != 0u,
           "adc samples before delayed trigger");
    expect(state, dspic33_device_advance(cpu, 1u), "advance to adc trigger");
    expect(state, (dspic33_read_word(cpu, 0x0320u) & 0x0002u) == 0u,
           "delayed trigger starts conversion");
    finish_conversion(cpu, 0u);
    expect(state, dspic33_read_word(cpu, 0x0300u) == 100u, "delayed trigger conversion result");

    dspic33_reset(cpu, 0u);
    set_input(cpu, 0u, 400u);
    configure_manual(cpu, 0u, 0u, 0x007cu, 0u);
    dspic33_write_word(cpu, 0x0332u, 0x0100u);
    for (sample = 1u; sample <= 32u; sample++) {
        start_manual(cpu, 0u);
        finish_conversion(cpu, 0u);
        expect(state,
               interrupt_flag(cpu, 13u) && cpu->io.adc_sample_count[0] == (uint8_t)(sample & 0x1fu),
               "adc one dma interrupt and increment threshold");
        clear_interrupt(cpu, 13u);
    }

    dspic33_reset(cpu, 0u);
    set_input(cpu, 0u, 400u);
    dspic33_write_word(cpu, 0x0324u, 0x0100u);
    dspic33_write_word(cpu, 0x0320u, 0x8074u);
    dspic33_write_word(cpu, 0x0320u, 0u);
    expect(state, dspic33_device_advance(cpu, 20u), "advance cancelled conversion");
    expect(state, dspic33_read_word(cpu, 0x0300u) == 0u, "disabled adc cancels conversion");

    dspic33_reset(cpu, 0u);
    set_input(cpu, 0u, 400u);
    configure_manual(cpu, 0u, 0u, 0u, 0u);
    cpu->device_cycles = UINT64_MAX;
    start_manual(cpu, 0u);
    expect(state,
           cpu->stop_reason == DSPIC33_EVENT_QUEUE_ERROR && cpu->events.count == 0u &&
               cpu->io.adc_latched_count[0] == 0u && (dspic33_read_word(cpu, 0x0320u) & 3u) == 0u,
           "adc conversion scheduling failure aborts deterministically");

    dspic33_reset(cpu, 0u);
    set_input(cpu, 0u, 400u);
    set_input(cpu, 1u, 800u);
    configure_manual(cpu, 0u, 0u, 0x0100u, 0u);
    cpu->device_cycles = UINT64_MAX - 12u;
    start_manual(cpu, 0u);
    dspic33_device_advance(cpu, 12u);
    expect(state,
           cpu->stop_reason == DSPIC33_EVENT_QUEUE_ERROR &&
               dspic33_read_word(cpu, 0x0300u) == 100u && cpu->io.adc_latched_count[0] == 0u &&
               cpu->events.count == 0u,
           "adc lane rescheduling failure preserves completed result and aborts");
}

static void analog_pin_cases(TestState* state, Dspic33* cpu) {
    dspic33_reset(cpu, 0u);
    set_input(cpu, 0u, 2400u);
    configure_manual(cpu, 0u, 0x0400u, 0u, 0u);
    start_manual(cpu, 0u);
    finish_conversion(cpu, 0u);
    expect(state, dspic33_read_word(cpu, 0x0300u) == 2400u,
           "analog input samples configured AN pin");

    dspic33_write_word(cpu, 0x0e1eu, (uint16_t)(dspic33_read_word(cpu, 0x0e1eu) & ~1u));
    start_manual(cpu, 0u);
    finish_conversion(cpu, 0u);
    expect(state, dspic33_read_word(cpu, 0x0300u) == 0u,
           "digital AN pin connects adc multiplexer to AVSS");

    dspic33_write_word(cpu, 0x0e1eu, (uint16_t)(dspic33_read_word(cpu, 0x0e1eu) | 1u));
    dspic33_write_word(cpu, 0x0e10u, (uint16_t)(dspic33_read_word(cpu, 0x0e10u) & ~1u));
    dspic33_write_word(cpu, 0x0e14u, (uint16_t)(dspic33_read_word(cpu, 0x0e14u) | 1u));
    start_manual(cpu, 0u);
    finish_conversion(cpu, 0u);
    expect(state, dspic33_read_word(cpu, 0x0300u) == 0x0fffu,
           "analog output pin converts driven high level");
    dspic33_write_word(cpu, 0x0e14u, (uint16_t)(dspic33_read_word(cpu, 0x0e14u) & ~1u));
    start_manual(cpu, 0u);
    finish_conversion(cpu, 0u);
    expect(state, dspic33_read_word(cpu, 0x0300u) == 0u,
           "analog output pin converts driven low level");

    dspic33_reset(cpu, 0u);
    set_input(cpu, 16u, 1600u);
    set_input(cpu, 22u, 2200u);
    set_input(cpu, 31u, 3100u);
    configure_manual(cpu, 0u, 0x0400u, 0u, 16u);
    start_manual(cpu, 0u);
    finish_conversion(cpu, 0u);
    expect(state, dspic33_read_word(cpu, 0x0300u) == 1600u,
           "channel sixteen uses RC1 analog selection");
    dspic33_write_word(cpu, 0x0320u, 0u);
    configure_manual(cpu, 0u, 0x0400u, 0u, 22u);
    start_manual(cpu, 0u);
    finish_conversion(cpu, 0u);
    expect(state, dspic33_read_word(cpu, 0x0300u) == 2200u,
           "channel twenty-two uses RA6 analog selection");
    dspic33_write_word(cpu, 0x0320u, 0u);
    configure_manual(cpu, 0u, 0x0400u, 0u, 31u);
    start_manual(cpu, 0u);
    finish_conversion(cpu, 0u);
    expect(state, dspic33_read_word(cpu, 0x0300u) == 3100u,
           "channel thirty-one uses RE7 analog selection");
}

static void copy_cases(TestState* state, Dspic33* cpu) {
    Dspic33 copy;
    bool initialized = dspic33_initialize(&copy);
    expect(state, initialized, "initialize adc copy");
    if (!initialized) {
        return;
    }
    dspic33_reset(cpu, 0u);
    set_input(cpu, 0u, 400u);
    dspic33_write_word(cpu, 0x0324u, 0x0100u);
    dspic33_write_word(cpu, 0x0320u, 0x8074u);
    expect(state, dspic33_copy(&copy, cpu), "copy adc state");
    expect(state, copy.io.adc_generation[0] == cpu->io.adc_generation[0], "copy adc generation");
    expect(state, copy.io.adc[0] == cpu->io.adc[0], "copy adc input");
    expect(state, copy.events.count == cpu->events.count, "copy adc events");
    dspic33_device_advance(cpu, 1u);
    dspic33_device_advance(&copy, 1u);
    dspic33_device_advance(cpu, 12u);
    dspic33_device_advance(&copy, 12u);
    expect(state, dspic33_read_word(&copy, 0x0300u) == dspic33_read_word(cpu, 0x0300u),
           "copied adc conversion result");
    expect(state, dspic33_read_word(&copy, 0x0320u) == dspic33_read_word(cpu, 0x0320u),
           "copied adc control state");

    dspic33_reset(cpu, 0u);
    set_input(cpu, 0u, 2000u);
    dspic33_load_program_word(cpu, 0u, RESET_OPCODE);
    cpu->pc = 0u;
    expect(state, dspic33_step(cpu) == DSPIC33_RUNNING && cpu->io.adc[0] == 2000u,
           "warm reset preserves external analog level");
    dspic33_reset(cpu, 0u);
    expect(state, cpu->io.adc[0] == 0u, "power reset clears analog stimulus model");

    dspic33_reset(cpu, 0u);
    configure_manual(cpu, 0u, 0u, 0u, 0u);
    dspic33_write_word(cpu, 0x0760u, 1u);
    expect(state, dspic33_copy(&copy, cpu), "copy adc PMD deadline");
    expect(state,
           dspic33_device_advance(cpu, 1u) && dspic33_device_advance(&copy, 1u) &&
               cpu->io.adc_pmd_disabled == 1u && copy.io.adc_pmd_disabled == 1u &&
               cpu->events.count == 0u && copy.events.count == 0u,
           "copied adc PMD transitions independently");

    dspic33_reset(cpu, 0u);
    configure_manual(cpu, 0u, 0u, 0u, 0u);
    dspic33_write_word(cpu, 0x0760u, 1u);
    dspic33_load_program_word(cpu, 0u, RESET_OPCODE);
    cpu->pc = 0u;
    expect(state,
           dspic33_step(cpu) == DSPIC33_RUNNING && dspic33_read_word(cpu, 0x0760u) == 0u &&
               cpu->io.adc_pmd_disabled == 0u && cpu->events.count == 0u,
           "warm reset cancels adc PMD transition");
    dspic33_release(&copy);
}

static void simultaneous_channel_erratum_cases(TestState* state, Dspic33* cpu) {
    uint8_t module;
    uint8_t channel;
    for (module = 0u; module < DSPIC33_ADC_COUNT; module++) {
        for (channel = 0u; channel <= 3u; channel += 3u) {
            dspic33_reset(cpu, 0u);
            dspic33_write_word(cpu, controls[module], 0u);
            dspic33_write_word(cpu, (uint16_t)(controls[module] + 2u), 0x0100u);
            dspic33_write_word(cpu, (uint16_t)(controls[module] + 4u), 0x0102u);
            dspic33_write_word(cpu, (uint16_t)(controls[module] + 8u), channel);
            dspic33_write_word(cpu, (uint16_t)(controls[module] + 6u), channel == 3u ? 1u : 0u);
            dspic33_write_word(cpu, controls[module], 0x8074u);
            dspic33_device_advance(cpu, 3u);
            expect(state,
                   cpu->stop_reason == DSPIC33_SILICON_RESULT_UNDEFINED &&
                       cpu->io.adc_latched_count[module] == 0u && cpu->events.count == 0u,
                   "B1 1.1 Msps CH0 and CH1 selection remains silicon-undefined");
        }
    }

    dspic33_reset(cpu, 0u);
    dspic33_write_word(cpu, 0x0322u, 0x0100u);
    dspic33_write_word(cpu, 0x0324u, 0x0102u);
    dspic33_write_word(cpu, 0x0326u, 1u);
    dspic33_write_word(cpu, 0x0320u, 0x8074u);
    dspic33_device_advance(cpu, 3u);
    expect(state, cpu->stop_reason == DSPIC33_RUNNING && cpu->io.adc_latched_count[0] == 2u,
           "different sequential channels remain outside the B1 erratum boundary");

    dspic33_reset(cpu, 0u);
    configure_manual(cpu, 0u, 0x0008u, 0x0100u, 0u);
    start_manual(cpu, 0u);
    expect(state, cpu->stop_reason == DSPIC33_RUNNING && cpu->io.adc_latched_count[0] == 2u,
           "manual simultaneous conversion remains outside the 1.1 Msps boundary");
}

int main(void) {
    Dspic33 cpu;
    TestState state = {0u, 0u, 0u};
    bool initialized = dspic33_initialize(&cpu);
    expect(&state, initialized, "initialize adc processor");
    if (!initialized) {
        fprintf(stderr, "cannot initialize ADC test simulator\n");
        return 1;
    }
    register_cases(&state, &cpu);
    format_cases(&state, &cpu);
    done_access_cases(&state, &cpu);
    done_active_conversion_cases(&state, &cpu);
    channel_cases(&state, &cpu);
    sequence_cases(&state, &cpu);
    conversion_pipeline_cases(&state, &cpu);
    threshold_cases(&state, &cpu);
    dma_interrupt_rate_cases(&state, &cpu);
    trigger_cases(&state, &cpu);
    timer_trigger_cases(&state, &cpu);
    dma_cases(&state, &cpu);
    power_cases(&state, &cpu);
    pmd_cases(&state, &cpu);
    boundary_cases(&state, &cpu);
    analog_pin_cases(&state, &cpu);
    simultaneous_channel_erratum_cases(&state, &cpu);
    copy_cases(&state, &cpu);
    dspic33_release(&cpu);
    return test_finish(&state);
}
